Repository: kaozdl/nihongo
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es

source: Language changed successfully
es: Idioma cambiado exitosamente

source: Exams
es: Exámenes

source: My Content
es: Mi Contenido

source: My History
es: Mi Historial

source: Admin
es: Administrador

source: Logout
es: Cerrar sesión

source: Login
es: Iniciar sesión

source: Register
es: Registrarse

source: Generate Random Practice Exam
es: Generar Examen de Práctica Aleatorio

source: Create a custom practice exam by selecting sections and number of questions.
es: Crea un examen de práctica personalizado seleccionando secciones y número de preguntas.

source: available
es: disponibles

source: Number of questions
es: Número de preguntas

source: Generate Random Exam
es: Generar Examen Aleatorio

source: No sections available. Please create sections and questions in the admin panel.
es: No hay secciones disponibles. Por favor, crea secciones y preguntas en el panel de administración.

source: Available Exams
es: Exámenes Disponibles

source: Created
es: Creado

source: By
es: Por

source: View Results
es: Ver Resultados

source: Retake Exam
es: Repetir Examen

source: Continue Test
es: Continuar Examen

source: Start Exam
es: Comenzar Examen

source: No exams available yet.
es: No hay exámenes disponibles aún.

source: Contact an administrator to create exams.
es: Contacta a un administrador para crear exámenes.

source: Email
es: Correo electrónico

source: Password
es: Contraseña

source: Don't have an account?
es: ¿No tienes una cuenta?

source: Register here
es: Regístrate aquí

source: Confirm Password
es: Confirmar Contraseña

source: Already have an account?
es: ¿Ya tienes una cuenta?

source: Login here
es: Inicia sesión aquí

source: You got %(correct)s out of %(total)s questions correct
es: Obtuviste %(correct)s de %(total)s preguntas correctas

source: Test Details
es: Detalles del Examen

source: Started
es: Iniciado

source: Completed
es: Completado

source: Back to Exams
es: Volver a Exámenes

source: Answer Review
es: Revisión de Respuestas

source: Question
es: Pregunta

source: Question image
es: Imagen de pregunta

source: Your Answer
es: Tu Respuesta

source: Not answered
es: Sin responder

source: Correct Answer
es: Respuesta Correcta

source: Explanation
es: Explicación

source: Your browser does not support the audio element.
es: Tu navegador no soporta el elemento de audio.

source: Are you sure you want to submit? You cannot change your answers after submission.
es: ¿Estás seguro de que quieres enviar? No podrás cambiar tus respuestas después del envío.

source: Submit Exam
es: Enviar Examen

source: Error saving answer. Please try again.
es: Error al guardar la respuesta. Por favor, inténtalo de nuevo.

source: My Exam History
es: Mi Historial de Exámenes

source: You have completed
es: Has completado

source: exam(s)
es: examen(es)

source: Exam Name
es: Nombre del Examen

source: Duration
es: Duración

source: Questions
es: Preguntas

source: Score
es: Puntuación

source: Grade
es: Calificación

source: Actions
es: Acciones

source: Excellent
es: Excelente

source: Good
es: Bien

source: Pass
es: Aprobado

source: Needs Work
es: Necesita Mejorar

source: View Details
es: Ver Detalles

source: Summary Statistics
es: Estadísticas Resumidas

source: Total Exams
es: Exámenes Totales

source: Average Score
es: Puntuación Promedio

source: Best Score
es: Mejor Puntuación

source: Total Questions
es: Preguntas Totales

source: You haven't completed any exams yet.
es: Aún no has completado ningún examen.

source: Start your first exam now!
es: ¡Comienza tu primer examen ahora!

source: Import Exam
es: Importar Examen

source: Import Exam from JSON
es: Importar Examen desde JSON

source: Upload a JSON file to import a complete exam with sections and questions. The exam will be added to your personal content.
es: Sube un archivo JSON para importar un examen completo con secciones y preguntas. El examen se agregará a tu contenido personal.

source: Select JSON File
es: Seleccionar Archivo JSON

source: Only .json files are accepted
es: Solo se aceptan archivos .json

source: Upload and Import
es: Subir e Importar

source: What happens when you import?
es: ¿Qué sucede cuando importas?

source: Exam is created with your name as creator
es: El examen se crea con tu nombre como creador

source: All sections are created or linked
es: Todas las secciones se crean o vinculan

source: All questions are imported
es: Todas las preguntas se importan

source: You become the owner of all content
es: Te conviertes en propietario de todo el contenido

source: Exam appears in your "My Exams" list
es: El examen aparece en tu lista "Mis Exámenes"

source: JSON Format Requirements
es: Requisitos del Formato JSON

source: Valid JSON syntax
es: Sintaxis JSON válida

source: Must include exam name
es: Debe incluir nombre del examen

source: At least one section
es: Al menos una sección

source: At least one question per section
es: Al menos una pregunta por sección

source: All questions must have 4 answers
es: Todas las preguntas deben tener 4 respuestas

source: Note:
es: Nota:

source: Make sure your JSON file follows the correct format. Check the documentation or download an example below.
es: Asegúrate de que tu archivo JSON siga el formato correcto. Consulta la documentación o descarga un ejemplo a continuación.

source: Download Example JSON
es: Descargar JSON de Ejemplo

source: Back to My Content
es: Volver a Mi Contenido

source: JSON Structure Example
es: Ejemplo de Estructura JSON

source: My N5 Practice Exam
es: Mi Examen de Práctica N5

source: Grammar
es: Gramática

source: The particle "no" indicates possession
es: La partícula "no" indica posesión

source: This is a simplified example. Download the full example for more details.
es: Este es un ejemplo simplificado. Descarga el ejemplo completo para más detalles.

source: Create and manage your own questions, sections, and exams
es: Crea y administra tus propias preguntas, secciones y exámenes

source: My Questions
es: Mis Preguntas

source: Create and edit your own questions with bilingual explanations
es: Crea y edita tus propias preguntas con explicaciones bilingües

source: Manage Questions
es: Administrar Preguntas

source: Sections
es: Secciones

source: Organize your questions into sections by topic
es: Organiza tus preguntas en secciones por tema

source: Manage Sections
es: Administrar Secciones

source: My Exams
es: Mis Exámenes

source: Create and manage complete exams from your sections
es: Crea y administra exámenes completos desde tus secciones

source: Manage Exams
es: Administrar Exámenes

source: Section Questions
es: Preguntas de Sección

source: Link questions to sections to build your content
es: Vincula preguntas a secciones para construir tu contenido

source: Manage Links
es: Administrar Vínculos

source: Exam Sections
es: Secciones de Examen

source: Link sections to exams to complete your exam structure
es: Vincula secciones a exámenes para completar la estructura del examen

source: Quickly import complete exams from JSON files
es: Importa rápidamente exámenes completos desde archivos JSON

source: Import from JSON
es: Importar desde JSON

source: Quick Tips
es: Consejos Rápidos

source: Getting Started
es: Comenzando

source: Create questions with bilingual explanations
es: Crea preguntas con explicaciones bilingües

source: Organize questions into sections (e.g., Grammar, Vocabulary)
es: Organiza preguntas en secciones (ej., Gramática, Vocabulario)

source: Link questions to sections
es: Vincula preguntas a secciones

source: Create an exam and link sections to it
es: Crea un examen y vincula secciones a él

source: Your exam will appear in the Exams page!
es: ¡Tu examen aparecerá en la página de Exámenes!

source: Quick Import
es: Importación Rápida

source: Want to create content faster? Use the Import Exam feature to upload a JSON file with complete exams, sections, and questions all at once!
es: ¿Quieres crear contenido más rápido? ¡Usa la función Importar Examen para subir un archivo JSON con exámenes completos, secciones y preguntas de una vez!

source: Go to Import
es: Ir a Importar

source: Coming Soon
es: Próximamente

source: Edit Question
es: Editar Pregunta

source: Create Question
es: Crear Pregunta

source: Create New Question
es: Crear Nueva Pregunta

source: Question Text
es: Texto de la Pregunta

source: Image URL
es: URL de Imagen

source: optional
es: opcional

source: Audio URL
es: URL de Audio

source: Answer Options
es: Opciones de Respuesta

source: Select correct answer...
es: Seleccione la respuesta correcta...

source: Bilingual Explanations
es: Explicaciones Bilingües

source: Explanation (English)
es: Explicación (Inglés)

source: Provide an explanation of why this answer is correct (in English)
es: Proporcione una explicación de por qué esta respuesta es correcta (en inglés)

source: Explanation (Español)
es: Explicación (Español)

source: Provide an explanation of why this answer is correct (in Spanish)
es: Proporcione una explicación de por qué esta respuesta es correcta (en español)

source: Update Question
es: Actualizar Pregunta

source: Cancel
es: Cancelar

source: Create and manage your own questions with bilingual explanations
es: Crea y administra tus propias preguntas con explicaciones bilingües

source: Edit
es: Editar

source: Delete
es: Eliminar

source: Are you sure you want to delete this question?
es: ¿Estás seguro de que quieres eliminar esta pregunta?

source: No questions yet
es: Aún no hay preguntas

source: Create your first question to get started!
es: ¡Crea tu primera pregunta para comenzar!

source: Create New Section
es: Crear Nueva Sección

source: Max Questions
es: Preguntas Máximas

source: Added
es: Agregadas

source: Are you sure you want to delete this section?
es: ¿Estás seguro de que quieres eliminar esta sección?

source: No sections yet
es: Aún no hay secciones

source: Create your first section to organize questions!
es: ¡Crea tu primera sección para organizar preguntas!

source: Edit Section
es: Editar Sección

source: Create Section
es: Crear Sección

source: Section Name
es: Nombre de la Sección

source: Choose a descriptive name for this section
es: Elige un nombre descriptivo para esta sección

source: Maximum Number of Questions
es: Número Máximo de Preguntas

source: How many questions should this section contain?
es: ¿Cuántas preguntas debe contener esta sección?

source: Update Section
es: Actualizar Sección

source: Create New Exam
es: Crear Nuevo Examen

source: Are you sure you want to delete this exam?
es: ¿Estás seguro de que quieres eliminar este examen?

source: No exams yet
es: Aún no hay exámenes

source: Edit Exam
es: Editar Examen

source: Create Exam
es: Crear Examen

source: Tip
es: Consejo

source: After creating your exam, you can link sections to it using the admin interface or by importing a JSON file.
es: Después de crear tu examen, puedes vincular secciones usando la interfaz de administración o importando un archivo JSON.

source: Choose a descriptive name for your exam
es: Elige un nombre descriptivo para tu examen

source: Update Exam
es: Actualizar Examen

source: Current Sections
es: Secciones Actuales

source: questions
es: preguntas

source: Remove this section from the exam?
es: ¿Quitar esta sección del examen?

source: No sections added yet. Add existing sections or create new ones below.
es: Aún no hay secciones agregadas. Agrega secciones existentes o crea nuevas abajo.

source: Add Existing Section
es: Agregar Sección Existente

source: Select Section
es: Seleccionar Sección

source: Choose a section...
es: Elige una sección...

source: Add
es: Agregar

source: Create & Add
es: Crear y Agregar

source: The section will be created and automatically added to this exam.
es: La sección se creará y se agregará automáticamente a este examen.

source: Current Questions
es: Preguntas Actuales

source: Answers
es: Respuestas

source: Reorder
es: Reordenar

source: Remove this question from the section?
es: ¿Quitar esta pregunta de la sección?

source: Remove
es: Quitar

source: No questions added yet. Add existing questions or create new ones below.
es: Aún no hay preguntas agregadas. Agrega preguntas existentes o crea nuevas abajo.

source: Add Existing Question
es: Agregar Pregunta Existente

source: Select Question
es: Seleccionar Pregunta

source: Choose a question...
es: Elige una pregunta...

source: Answer 1
es: Respuesta 1

source: Answer 2
es: Respuesta 2

source: Answer 3
es: Respuesta 3

source: Answer 4
es: Respuesta 4

source: Create & Add Question
es: Crear y Agregar Pregunta

source: The question will be created and automatically added to this section.
es: La pregunta se creará y se agregará automáticamente a esta sección.

source: Section Details
es: Detalles de la Sección

source: Questions in this section
es: Preguntas en esta sección

source: No questions in this section yet. Add questions by editing the section.
es: Aún no hay preguntas en esta sección. Agrega preguntas editando la sección.

source: Order
es: Orden

source: Remove Section
es: Quitar Sección

source: Create an exam and give it a name
es: Crea un examen y dale un nombre

source: Add sections inline (or create new ones on the fly)
es: Agrega secciones en línea (o crea nuevas sobre la marcha)

source: Edit each section and add questions inline
es: Edita cada sección y agrega preguntas en línea

source: Create questions directly or link existing ones
es: Crea preguntas directamente o vincula las existentes

source: Pro Tip
es: Consejo Pro

source: Everything can be done inline - no need to navigate between pages!
es: ¡Todo se puede hacer en línea - no necesitas navegar entre páginas!

source: Used in
es: Usado en

source: Not used in any exam yet
es: No usado en ningún examen aún
